rfblue2/pic-disassembler/src/include/p16f1459.inc
_CPUDIV_NOCLKDIV EQU  H'FFCF'    ; NO CPU system divide
_CPUDIV_CLKDIV2  EQU  H'FFDF'    ; CPU system clock divided by 2
_CPUDIV_CLKDIV3  EQU  H'FFEF'    ; CPU system clock divided by 3
_CPUDIV_CLKDIV6  EQU  H'FFFF'    ; CPU system clock divided by 6

_USBLSCLK_24MHz  EQU  H'FFBF'    ; System clock expects 24 MHz, FS/LS USB CLKENs divide-by is set to 4.
_USBLSCLK_48MHz  EQU  H'FFFF'    ; System clock expects 48 MHz, FS/LS USB CLKENs divide-by is set to 8.

_PLLMULT_4x      EQU  H'FF7F'    ; 4x Output Frequency Selected
_PLLMULT_3x      EQU  H'FFFF'    ; 3x Output Frequency Selected

_PLLEN_DISABLED  EQU  H'FEFF'    ; 3x or 4x PLL Disabled
_PLLEN_ENABLED   EQU  H'FFFF'    ; 3x or 4x PLL Enabled

_STVREN_OFF      EQU  H'FDFF'    ; Stack Overflow or Underflow will not cause a Reset
_STVREN_ON       EQU  H'FFFF'    ; Stack Overflow or Underflow will cause a Reset

_BORV_HI         EQU  H'FBFF'    ; Brown-out Reset Voltage (Vbor), high trip point selected.
_BORV_LO         EQU  H'FFFF'    ; Brown-out Reset Voltage (Vbor), low trip point selected.

_LPBOR_ON        EQU  H'F7FF'    ; Low-Power BOR is enabled
_LPBOR_OFF       EQU  H'FFFF'    ; Low-Power BOR is disabled

_LVP_OFF         EQU  H'DFFF'    ; High-voltage on MCLR/VPP must be used for programming
_LVP_ON          EQU  H'FFFF'    ; Low-voltage programming enabled

;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'8006'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'8000'
_IDLOC1          EQU  H'8001'
_IDLOC2          EQU  H'8002'
_IDLOC3          EQU  H'8003'

        LIST
